cf_billing/DataProcessors/бестГрупповойВводСобытийПИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестГрупповойВводСобытийПИР</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/Documents/энргСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСобытие</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобытия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одинарный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудСудебныйУчастокДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСуды</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанцияДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудьяДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйАктДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСудебногоАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилуДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтветственностиДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргИсполнительнаяОтветственностьПИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРамкахЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Абоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успех</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бестПараметрыТиповСобытий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПросуженнаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Потребитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргСпособСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСпособСвязи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтапПИР</Name>
					<Comment>Переопределен на табличную часть(Этапы ПИР).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиСогласующих</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапПИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаМакетовПФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/бестГрупповойВводСобытийПИР/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем СписокАбонентов;
	
	Если Параметры.Свойство("СписокАбонентов", СписокАбонентов) Тогда
	
		ДанныеОбАбонентах = Обработки.бестГрупповойВводСобытийПИР.ПолучитьДанныеОбАбоненте(СписокАбонентов);
		
		Для каждого ДанныеОбАбоненте Из ДанныеОбАбонентах Цикл
			
			ТекСтрока = Абоненты.Добавить();
			ТекСтрока.Ид = Новый УникальныйИдентификатор;
			
			ЗаполнитьЗначенияСвойств(ТекСтрока, ДанныеОбАбоненте);
			
			Для каждого ЗадачаАбонента Из ДанныеОбАбоненте.Задачи Цикл
				Если Не ЗначениеЗаполнено(ЗадачаАбонента) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТЗ = ЗадачиАбонента.Добавить();
				СтрокаТЗ.ИдАбонента = ТекСтрока.Ид;
				СтрокаТЗ.Задача		= ЗадачаАбонента;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьЗадачиАбонента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСобытияПриИзменении(Элемент)
	ЗаполнитьПараметрыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАбоненты

&НаКлиенте
Процедура АбонентыПриАктивизацииСтроки(Элемент)
	ОтобразитьЗадачиАбонента();
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		СтрокиЗадач = ЗадачиАбонента.НайтиСтроки(Новый Структура("ИдАбонента", ТекСтрока.Ид));
		
		Для каждого СтрокаУдаления Из СтрокиЗадач Цикл
			ЗадачиАбонента.Удалить(СтрокаУдаления);		
		КонецЦикла;
		
		Отбор = Новый Структура("ИдАбонента", Неопределено);
		Элементы.Задачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
		ТекСтрока.Ид = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыАбонентПриИзменении(Элемент)
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		ОбновитьДанныеОбАбоненте(Элементы.Абоненты.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачи

&НаКлиенте
Процедура ЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьСобытия(Команда)
	СоздатьСобытияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
	ЗначПарам = Новый Соответствие;
	
	Для каждого СтрокаТЧ Из ПараметрыСобытия Цикл
		ЗначПарам.Вставить(СтрокаТЧ.Параметр, СтрокаТЧ.Значение);
	КонецЦикла;
	
	ПараметрыСобытия.Очистить();
	
	СписокПараметровТипа = Справочники.энргСпособСвязи.ПолучитьСписокПараметров(ТипСобытия);
	
	Для каждого Параметр Из СписокПараметровТипа Цикл
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			СтрокаТЧ = ПараметрыСобытия.Добавить();
			
			СтрокаТЧ.Параметр = Параметр;
			
			Значение		  = ЗначПарам.Получить(Параметр);
			Если Значение <> Неопределено Тогда
				СтрокаТЧ.Значение = Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеОбАбоненте(ИдентификаторСтроки)

	ТекСтрока = Абоненты.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокиЗадач = ЗадачиАбонента.НайтиСтроки(Новый Структура("ИдАбонента", ТекСтрока.Ид));
	Для каждого СтрокаУдаления Из СтрокиЗадач Цикл
		ЗадачиАбонента.Удалить(СтрокаУдаления);		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекСтрока.Абонент) Тогда
		ДанныеОбАбоненте = Обработки.бестГрупповойВводСобытийПИР.ПолучитьДанныеОбАбоненте(ТекСтрока.Абонент);
		
		Если ТипЗнч(ДанныеОбАбоненте) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ТекСтрока, ДанныеОбАбоненте);
			
			Для каждого ЗадачаАбонента Из ДанныеОбАбоненте.Задачи Цикл
				Если Не ЗначениеЗаполнено(ЗадачаАбонента) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТЗ = ЗадачиАбонента.Добавить();
				СтрокаТЗ.ИдАбонента = ТекСтрока.Ид;
				СтрокаТЗ.Задача		= ЗадачаАбонента;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЗадачиАбонента()
	
	Перем ИдАбонента, Отбор, ТекСтрока;
	
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	
	ИдАбонента = ?(ТекСтрока = Неопределено, Неопределено, ТекСтрока.Ид);
	
	Отбор = Новый Структура("ИдАбонента", ИдАбонента);
	Элементы.Задачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСобытияНаСервере()

	Для каждого СтрокаТЗ Из Абоненты Цикл
	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Абонент) Тогда
			Продолжить;
		КонецЕсли;
		
		Событие = Документы.энргСобытие.СоздатьДокумент();
		Событие.Дата = ТекущаяДата();
		Событие.ТипСобытия = ТипСобытия;
		Событие.Организация = СтрокаТЗ.Организация;
		
		СтрокиЗадач = ЗадачиАбонента.НайтиСтроки(Новый Структура("ИдАбонента", СтрокаТЗ.Ид));
		Событие.Одинарный = СтрокиЗадач.Количество() <= 1;
		
		Если Событие.Одинарный Тогда
			Задача = ?(ЗначениеЗаполнено(СтрокиЗадач), СтрокиЗадач[0].Задача, Неопределено);
			
			СтрокаТЧ = Событие.Абоненты.Добавить();
			
			СтрокаТЧ.Абонент = СтрокаТЗ.Абонент;
			СтрокаТЧ.Основание = Задача;
		Иначе	
			Для каждого СтрокаЗадачи Из СтрокиЗадач Цикл
				СтрокаТЧ = Событие.Абоненты.Добавить();
				
				СтрокаТЧ.Абонент = СтрокаТЗ.Абонент;
				СтрокаТЧ.Основание = СтрокаЗадачи.Задача;
			КонецЦикла;
		КонецЕсли;
		
		Для каждого СтрокаПарам Из ПараметрыСобытия Цикл
		
			СтрокаТЧ = Событие.Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаПарам);
		
		КонецЦикла;
		
		Событие.Записать();
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
